librbd_iscsi/yujiang/read/logs/fio-iscsi-1m.fio.log
lv0: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;232946688;388229;379;600023;21;4236;79.146413;41.511644;7909;1453804;42117.637266;90265.526331;1.000000%=17694;5.000000%=20578;10.000000%=21626;20.000000%=22937;30.000000%=24248;40.000000%=25296;50.000000%=26345;60.000000%=27394;70.000000%=29229;80.000000%=34865;90.000000%=42205;95.000000%=47448;99.000000%=599785;99.500000%=725614;99.900000%=926941;99.950000%=1019215;99.990000%=1199570;0%=0;0%=0;0%=0;8469;1453872;42197.314418;90267.215136;14336;804864;99.987192%;388179.275000;263006.758302;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.354820%;3.495705%;227672;0;8214;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;3.66%;92.13%;1.73%;0.02%;0.94%;1.09%;0.36%;0.06%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=3828722: Thu May 21 11:22:07 2020
   read: IOPS=379, BW=379MiB/s (398MB/s)(222GiB/600023msec)
    slat (usec): min=21, max=4236, avg=79.15, stdev=41.51
    clat (msec): min=7, max=1453, avg=42.12, stdev=90.27
     lat (msec): min=8, max=1453, avg=42.20, stdev=90.27
    clat percentiles (msec):
     |  1.00th=[   18],  5.00th=[   21], 10.00th=[   22], 20.00th=[   23],
     | 30.00th=[   25], 40.00th=[   26], 50.00th=[   27], 60.00th=[   28],
     | 70.00th=[   30], 80.00th=[   35], 90.00th=[   43], 95.00th=[   48],
     | 99.00th=[  600], 99.50th=[  726], 99.90th=[  927], 99.95th=[ 1020],
     | 99.99th=[ 1200]
   bw (  KiB/s): min=14336, max=804864, per=99.99%, avg=388179.28, stdev=263006.76, samples=1200
   iops        : min=   14, max=  786, avg=379.04, stdev=256.85, samples=1200
  lat (msec)   : 10=0.01%, 20=3.66%, 50=92.13%, 100=1.73%, 250=0.02%
  lat (msec)   : 500=0.94%, 750=1.09%, 1000=0.36%, 2000=0.06%
  cpu          : usr=0.35%, sys=3.50%, ctx=227672, majf=0, minf=8214
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=227487,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=379MiB/s (398MB/s), 379MiB/s-379MiB/s (398MB/s-398MB/s), io=222GiB (239GB), run=600023-600023msec