librbd_iscsi/yujiang/read/logs/fio-iscsi-256k.fio.log
lv0: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;99102720;165012;644;600576;7;3742;27.010925;19.061551;1538;1045159;24790.610354;73782.918315;1.000000%=2834;5.000000%=3424;10.000000%=3948;20.000000%=4816;30.000000%=5799;40.000000%=6914;50.000000%=8224;60.000000%=9371;70.000000%=10551;80.000000%=11862;90.000000%=14483;95.000000%=130547;99.000000%=429916;99.500000%=488636;99.900000%=624951;99.950000%=675282;99.990000%=817889;0%=0;0%=0;0%=0;1567;1045193;24817.995045;73784.873412;512;538624;99.998603%;165009.694421;219261.634250;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.411606%;2.343254%;386113;0;3101;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.02%;10.44%;54.51%;27.49%;1.11%;0.90%;2.43%;2.66%;0.42%;0.02%;0.01%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=3809485: Thu May 21 11:12:07 2020
   read: IOPS=644, BW=161MiB/s (169MB/s)(94.5GiB/600576msec)
    slat (usec): min=7, max=3742, avg=27.01, stdev=19.06
    clat (usec): min=1538, max=1045.2k, avg=24790.61, stdev=73782.92
     lat (usec): min=1567, max=1045.2k, avg=24818.00, stdev=73784.87
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    4], 20.00th=[    5],
     | 30.00th=[    6], 40.00th=[    7], 50.00th=[    9], 60.00th=[   10],
     | 70.00th=[   11], 80.00th=[   12], 90.00th=[   15], 95.00th=[  131],
     | 99.00th=[  430], 99.50th=[  489], 99.90th=[  625], 99.95th=[  676],
     | 99.99th=[  818]
   bw (  KiB/s): min=  512, max=538624, per=100.00%, avg=165009.69, stdev=219261.63, samples=1201
   iops        : min=    2, max= 2104, avg=644.52, stdev=856.51, samples=1201
  lat (msec)   : 2=0.02%, 4=10.44%, 10=54.51%, 20=27.49%, 50=1.11%
  lat (msec)   : 100=0.90%, 250=2.43%, 500=2.66%, 750=0.42%, 1000=0.02%
  lat (msec)   : 2000=0.01%
  cpu          : usr=0.41%, sys=2.34%, ctx=386113, majf=0, minf=3101
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=387120,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=161MiB/s (169MB/s), 161MiB/s-161MiB/s (169MB/s-169MB/s), io=94.5GiB (101GB), run=600576-600576msec