librbd_iscsi/yujiang/read/logs/fio-iscsi-4k.fio.log
lv0: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;18830288;31383;7845;600002;1;517;6.981355;4.072299;389;305982;2030.745410;2531.877111;1.000000%=1204;5.000000%=1318;10.000000%=1384;20.000000%=1466;30.000000%=1548;40.000000%=1613;50.000000%=1695;60.000000%=1777;70.000000%=1892;80.000000%=2023;90.000000%=2277;95.000000%=2572;99.000000%=17432;99.500000%=23461;99.900000%=30015;99.950000%=32112;99.990000%=40108;0%=0;0%=0;0%=0;402;305990;2037.953649;2532.271222;512;40648;99.991604%;31380.365000;10323.556975;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2.431496%;8.249486%;4462245;0;85;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.05%;0.18%;78.24%;19.90%;0.37%;0.45%;0.79%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=3753171: Thu May 21 10:42:04 2020
   read: IOPS=7845, BW=30.6MiB/s (32.1MB/s)(17.0GiB/600002msec)
    slat (nsec): min=1721, max=517106, avg=6981.35, stdev=4072.30
    clat (usec): min=389, max=305982, avg=2030.75, stdev=2531.88
     lat (usec): min=402, max=305990, avg=2037.95, stdev=2532.27
    clat percentiles (usec):
     |  1.00th=[ 1205],  5.00th=[ 1319], 10.00th=[ 1385], 20.00th=[ 1467],
     | 30.00th=[ 1549], 40.00th=[ 1614], 50.00th=[ 1696], 60.00th=[ 1778],
     | 70.00th=[ 1893], 80.00th=[ 2024], 90.00th=[ 2278], 95.00th=[ 2573],
     | 99.00th=[17433], 99.50th=[23462], 99.90th=[30016], 99.95th=[32113],
     | 99.99th=[40109]
   bw (  KiB/s): min=  512, max=40648, per=99.99%, avg=31380.37, stdev=10323.56, samples=1200
   iops        : min=  128, max=10162, avg=7845.07, stdev=2580.89, samples=1200
  lat (usec)   : 500=0.01%, 750=0.05%, 1000=0.18%
  lat (msec)   : 2=78.24%, 4=19.90%, 10=0.37%, 20=0.45%, 50=0.79%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=2.43%, sys=8.25%, ctx=4462245, majf=0, minf=85
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=4707572,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=30.6MiB/s (32.1MB/s), 30.6MiB/s-30.6MiB/s (32.1MB/s-32.1MB/s), io=17.0GiB (19.3GB), run=600002-600002msec