librbd_iscsi/yujiang/read/logs/fio-iscsi-64k.fio.log
lv0: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;70719104;117863;1841;600009;3;1194;15.761856;7.995433;447;484291;8669.351754;15266.199017;1.000000%=1548;5.000000%=2179;10.000000%=2867;20.000000%=4751;30.000000%=6586;40.000000%=7700;50.000000%=8224;60.000000%=8716;70.000000%=9371;80.000000%=10551;90.000000%=11862;95.000000%=12648;99.000000%=16580;99.500000%=26607;99.900000%=325058;99.950000%=341835;99.990000%=367001;0%=0;0%=0;0%=0;651;484312;8685.462241;15266.819485;2816;163712;100.000000%;117863.570833;32652.507046;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.205151%;4.568772%;1069169;0;807;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.05%;3.31%;12.64%;60.21%;22.99%;0.48%;0.04%;0.09%;0.20%;0.00%;0.00%;0.00%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=3791192: Thu May 21 11:02:05 2020
   read: IOPS=1841, BW=115MiB/s (121MB/s)(67.4GiB/600009msec)
    slat (usec): min=3, max=1194, avg=15.76, stdev= 8.00
    clat (usec): min=447, max=484291, avg=8669.35, stdev=15266.20
     lat (usec): min=651, max=484312, avg=8685.46, stdev=15266.82
    clat percentiles (usec):
     |  1.00th=[  1549],  5.00th=[  2180], 10.00th=[  2868], 20.00th=[  4752],
     | 30.00th=[  6587], 40.00th=[  7701], 50.00th=[  8225], 60.00th=[  8717],
     | 70.00th=[  9372], 80.00th=[ 10552], 90.00th=[ 11863], 95.00th=[ 12649],
     | 99.00th=[ 16581], 99.50th=[ 26608], 99.90th=[325059], 99.95th=[341836],
     | 99.99th=[367002]
   bw (  KiB/s): min= 2816, max=163712, per=100.00%, avg=117863.57, stdev=32652.51, samples=1200
   iops        : min=   44, max= 2558, avg=1841.58, stdev=510.20, samples=1200
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.05%
  lat (msec)   : 2=3.31%, 4=12.64%, 10=60.21%, 20=22.99%, 50=0.48%
  lat (msec)   : 100=0.04%, 250=0.09%, 500=0.20%
  cpu          : usr=1.21%, sys=4.57%, ctx=1069169, majf=0, minf=807
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1104986,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=115MiB/s (121MB/s), 115MiB/s-115MiB/s (121MB/s-121MB/s), io=67.4GiB (72.4GB), run=600009-600009msec