librbd_iscsi/yujiang/read/logs/fio-iscsi-8k.fio.log
lv0: (g=0): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;32718976;54529;6816;600019;1;655;7.606594;4.836139;150;222874;2338.049559;2875.311498;1.000000%=667;5.000000%=888;10.000000%=1433;20.000000%=1744;30.000000%=1875;40.000000%=1990;50.000000%=2113;60.000000%=2244;70.000000%=2375;80.000000%=2572;90.000000%=2932;95.000000%=3260;99.000000%=4947;99.500000%=17432;99.900000%=47972;99.950000%=52166;99.990000%=58982;0%=0;0%=0;0%=0;351;222881;2345.884588;2875.634799;2688;81328;99.995047%;54526.299167;14623.149568;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2.231266%;7.600939%;3928087;0;129;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.04%;2.25%;4.52%;33.82%;57.52%;1.29%;0.08%;0.41%;0.07%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=3772474: Thu May 21 10:52:05 2020
   read: IOPS=6816, BW=53.3MiB/s (55.8MB/s)(31.2GiB/600019msec)
    slat (nsec): min=1941, max=655109, avg=7606.59, stdev=4836.14
    clat (usec): min=150, max=222874, avg=2338.05, stdev=2875.31
     lat (usec): min=351, max=222881, avg=2345.88, stdev=2875.63
    clat percentiles (usec):
     |  1.00th=[  668],  5.00th=[  889], 10.00th=[ 1434], 20.00th=[ 1745],
     | 30.00th=[ 1876], 40.00th=[ 1991], 50.00th=[ 2114], 60.00th=[ 2245],
     | 70.00th=[ 2376], 80.00th=[ 2573], 90.00th=[ 2933], 95.00th=[ 3261],
     | 99.00th=[ 4948], 99.50th=[17433], 99.90th=[47973], 99.95th=[52167],
     | 99.99th=[58983]
   bw (  KiB/s): min= 2688, max=81328, per=100.00%, avg=54526.30, stdev=14623.15, samples=1200
   iops        : min=  336, max=10166, avg=6815.76, stdev=1827.90, samples=1200
  lat (usec)   : 250=0.01%, 500=0.04%, 750=2.25%, 1000=4.52%
  lat (msec)   : 2=33.82%, 4=57.52%, 10=1.29%, 20=0.08%, 50=0.41%
  lat (msec)   : 100=0.07%, 250=0.01%
  cpu          : usr=2.23%, sys=7.60%, ctx=3928087, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=4089872,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=53.3MiB/s (55.8MB/s), 53.3MiB/s-53.3MiB/s (55.8MB/s-55.8MB/s), io=31.2GiB (33.5GB), run=600019-600019msec